Ran Plan for 4 projects:

1. dir: `live/atlantis/iam` workspace: `default`
1. dir: `live/dev/iam` workspace: `default`
1. dir: `live/dev/ec2` workspace: `default`
1. dir: `live/qa/ec2` workspace: `default`

### 1. dir: `live/atlantis/iam` workspace: `default`
<details><summary>Show Output</summary>

```diff
[terragrunt] 2020/01/15 11:45:42 Reading Terragrunt config file at /home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/5/default/live/atlantis/iam/terragrunt.hcl
[terragrunt] [/home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/5/default/live/atlantis/iam] 2020/01/15 11:45:42 Running command: terraform --version
[terragrunt] 2020/01/15 11:45:42 WARNING: no double-slash (//) found in source URL /home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/5/default/modules/EmptyModule. Relative paths in downloaded Terraform code may not work.
[terragrunt] 2020/01/15 11:45:42 Downloading Terraform configurations from file:///home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/5/default/modules/EmptyModule into /home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/5/default/live/atlantis/iam/.terragrunt-cache/jQBwtsobTorzVoBLUmFAkQ4nWcw/4_nKPqJI-HbzDjYmZKOgdTnB2jw
[terragrunt] 2020/01/15 11:45:42 Copying files from /home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/5/default/live/atlantis/iam into /home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/5/default/live/atlantis/iam/.terragrunt-cache/jQBwtsobTorzVoBLUmFAkQ4nWcw/4_nKPqJI-HbzDjYmZKOgdTnB2jw
[terragrunt] 2020/01/15 11:45:42 Setting working directory to /home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/5/default/live/atlantis/iam/.terragrunt-cache/jQBwtsobTorzVoBLUmFAkQ4nWcw/4_nKPqJI-HbzDjYmZKOgdTnB2jw
[terragrunt] 2020/01/15 11:45:42 Running command: terraform plan -no-color -out /home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/5/default/live/atlantis/iam/default.tfplan
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.


------------------------------------------------------------------------

No changes. Infrastructure is up-to-date.

This means that Terraform did not detect any differences between your
configuration and real physical resources that exist. As a result, no
actions need to be performed.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d live/atlantis/iam`
* :put_litter_in_its_place: To **delete** this plan click [here](http://ip-172-31-37-232:8080/lock?id=vaibhav-walke%252Fterragrunt%252Flive%252Fatlantis%252Fiam%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d live/atlantis/iam`
</details>

---
### 2. dir: `live/dev/iam` workspace: `default`
<details><summary>Show Output</summary>

```diff
[terragrunt] 2020/01/15 11:45:43 Reading Terragrunt config file at /home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/5/default/live/dev/iam/terragrunt.hcl
[terragrunt] [/home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/5/default/live/dev/iam] 2020/01/15 11:45:43 Running command: terraform --version
[terragrunt] 2020/01/15 11:45:43 WARNING: no double-slash (//) found in source URL /home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/5/default/modules/EmptyModule. Relative paths in downloaded Terraform code may not work.
[terragrunt] 2020/01/15 11:45:43 Downloading Terraform configurations from file:///home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/5/default/modules/EmptyModule into /home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/5/default/live/dev/iam/.terragrunt-cache/Xy-zeOLGaIRQY9AskDQBqbX56S0/4_nKPqJI-HbzDjYmZKOgdTnB2jw
[terragrunt] 2020/01/15 11:45:43 Copying files from /home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/5/default/live/dev/iam into /home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/5/default/live/dev/iam/.terragrunt-cache/Xy-zeOLGaIRQY9AskDQBqbX56S0/4_nKPqJI-HbzDjYmZKOgdTnB2jw
[terragrunt] 2020/01/15 11:45:43 Setting working directory to /home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/5/default/live/dev/iam/.terragrunt-cache/Xy-zeOLGaIRQY9AskDQBqbX56S0/4_nKPqJI-HbzDjYmZKOgdTnB2jw
[terragrunt] 2020/01/15 11:45:43 Running command: terraform plan -no-color -out /home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/5/default/live/dev/iam/default.tfplan
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.


------------------------------------------------------------------------

No changes. Infrastructure is up-to-date.

This means that Terraform did not detect any differences between your
configuration and real physical resources that exist. As a result, no
actions need to be performed.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d live/dev/iam`
* :put_litter_in_its_place: To **delete** this plan click [here](http://ip-172-31-37-232:8080/lock?id=vaibhav-walke%252Fterragrunt%252Flive%252Fdev%252Fiam%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d live/dev/iam`
</details>

---
### 3. dir: `live/dev/ec2` workspace: `default`
<details><summary>Show Output</summary>

```diff
[terragrunt] 2020/01/15 11:45:45 Reading Terragrunt config file at /home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/5/default/live/dev/ec2/terragrunt.hcl
[terragrunt] [/home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/5/default/live/dev/ec2] 2020/01/15 11:45:45 Running command: terraform --version
[terragrunt] 2020/01/15 11:45:45 WARNING: no double-slash (//) found in source URL /home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/5/default/modules/web-server-modules. Relative paths in downloaded Terraform code may not work.
[terragrunt] 2020/01/15 11:45:45 Downloading Terraform configurations from file:///home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/5/default/modules/web-server-modules into /home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/5/default/live/dev/ec2/.terragrunt-cache/CU-T-ke6IyaCFQfRHoiSKYA-nqs/jW1lFaumdNSQ98eeRxwKuQC4DvU
[terragrunt] 2020/01/15 11:45:45 Copying files from /home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/5/default/live/dev/ec2 into /home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/5/default/live/dev/ec2/.terragrunt-cache/CU-T-ke6IyaCFQfRHoiSKYA-nqs/jW1lFaumdNSQ98eeRxwKuQC4DvU
[terragrunt] 2020/01/15 11:45:45 Setting working directory to /home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/5/default/live/dev/ec2/.terragrunt-cache/CU-T-ke6IyaCFQfRHoiSKYA-nqs/jW1lFaumdNSQ98eeRxwKuQC4DvU
[terragrunt] 2020/01/15 11:45:45 Running command: terraform plan -no-color -out /home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/5/default/live/dev/ec2/default.tfplan
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

data.aws_availability_zones.all: Refreshing state...
data.aws_ami.ubuntu: Refreshing state...

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_autoscaling_group.webserver_example will be created
  + resource "aws_autoscaling_group" "webserver_example" {
      + arn                       = (known after apply)
      + availability_zones        = [
          + "eu-west-1a",
          + "eu-west-1b",
          + "eu-west-1c",
        ]
      + default_cooldown          = (known after apply)
      + desired_capacity          = (known after apply)
      + force_delete              = false
      + health_check_grace_period = 300
      + health_check_type         = "ELB"
      + id                        = (known after apply)
      + launch_configuration      = (known after apply)
      + load_balancers            = [
          + "webserver-example-qa",
        ]
      + max_size                  = 2
      + metrics_granularity       = "1Minute"
      + min_size                  = 2
      + name                      = (known after apply)
      + protect_from_scale_in     = false
      + service_linked_role_arn   = (known after apply)
      + target_group_arns         = (known after apply)
      + vpc_zone_identifier       = (known after apply)
      + wait_for_capacity_timeout = "10m"

      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "webserver-example-qa"
        }
    }

  # aws_elb.webserver_example will be created
  + resource "aws_elb" "webserver_example" {
      + arn                         = (known after apply)
      + availability_zones          = [
          + "eu-west-1a",
          + "eu-west-1b",
          + "eu-west-1c",
        ]
      + connection_draining         = false
      + connection_draining_timeout = 300
      + cross_zone_load_balancing   = true
      + dns_name                    = (known after apply)
      + id                          = (known after apply)
      + idle_timeout                = 60
      + instances                   = (known after apply)
      + internal                    = (known after apply)
      + name                        = "webserver-example-qa"
      + security_groups             = (known after apply)
      + source_security_group       = (known after apply)
      + source_security_group_id    = (known after apply)
      + subnets                     = (known after apply)
      + zone_id                     = (known after apply)

      + health_check {
          + healthy_threshold   = 2
          + interval            = 30
          + target              = "HTTP:8080/"
          + timeout             = 3
          + unhealthy_threshold = 2
        }

      + listener {
          + instance_port     = 8080
          + instance_protocol = "http"
          + lb_port           = 80
          + lb_protocol       = "http"
        }
    }

  # aws_launch_configuration.webserver_example will be created
  + resource "aws_launch_configuration" "webserver_example" {
      + arn                         = (known after apply)
      + associate_public_ip_address = false
      + ebs_optimized               = (known after apply)
      + enable_monitoring           = true
      + id                          = (known after apply)
      + image_id                    = "ami-0b508e9b54730f606"
      + instance_type               = "t2.micro"
      + key_name                    = (known after apply)
      + name                        = (known after apply)
      + security_groups             = (known after apply)
      + user_data                   = "4430fd6498339061effa6d27ccf341a1e94569d7"

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + no_device             = (known after apply)
          + snapshot_id           = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # aws_security_group.asg will be created
  + resource "aws_security_group" "asg" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "webserver-example-qa-asg"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.elb will be created
  + resource "aws_security_group" "elb" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "webserver-example-qa-elb"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + vpc_id                 = (known after apply)
    }

  # aws_security_group_rule.asg_allow_http_inbound will be created
  + resource "aws_security_group_rule" "asg_allow_http_inbound" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 8080
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 8080
      + type                     = "ingress"
    }

  # aws_security_group_rule.elb_allow_all_outbound will be created
  + resource "aws_security_group_rule" "elb_allow_all_outbound" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # aws_security_group_rule.elb_allow_http_inbound will be created
  + resource "aws_security_group_rule" "elb_allow_http_inbound" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 80
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "ingress"
    }

Plan: 8 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

This plan was saved to: /home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/5/default/live/dev/ec2/default.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/5/default/live/dev/ec2/default.tfplan"


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d live/dev/ec2`
* :put_litter_in_its_place: To **delete** this plan click [here](http://ip-172-31-37-232:8080/lock?id=vaibhav-walke%252Fterragrunt%252Flive%252Fdev%252Fec2%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d live/dev/ec2`
</details>

---
### 4. dir: `live/qa/ec2` workspace: `default`
<details><summary>Show Output</summary>

```diff
[terragrunt] 2020/01/15 11:45:48 Reading Terragrunt config file at /home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/5/default/live/qa/ec2/terragrunt.hcl
[terragrunt] [/home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/5/default/live/qa/ec2] 2020/01/15 11:45:48 Running command: terraform --version
[terragrunt] 2020/01/15 11:45:48 WARNING: no double-slash (//) found in source URL /home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/5/default/modules/web-server-modules. Relative paths in downloaded Terraform code may not work.
[terragrunt] 2020/01/15 11:45:48 Downloading Terraform configurations from file:///home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/5/default/modules/web-server-modules into /home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/5/default/live/qa/ec2/.terragrunt-cache/ocS55gxwBoRy3x8wK93w9EP5UsQ/jW1lFaumdNSQ98eeRxwKuQC4DvU
[terragrunt] 2020/01/15 11:45:48 Copying files from /home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/5/default/live/qa/ec2 into /home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/5/default/live/qa/ec2/.terragrunt-cache/ocS55gxwBoRy3x8wK93w9EP5UsQ/jW1lFaumdNSQ98eeRxwKuQC4DvU
[terragrunt] 2020/01/15 11:45:48 Setting working directory to /home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/5/default/live/qa/ec2/.terragrunt-cache/ocS55gxwBoRy3x8wK93w9EP5UsQ/jW1lFaumdNSQ98eeRxwKuQC4DvU
[terragrunt] 2020/01/15 11:45:49 Running command: terraform plan -no-color -out /home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/5/default/live/qa/ec2/default.tfplan
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

data.aws_availability_zones.all: Refreshing state...
data.aws_ami.ubuntu: Refreshing state...

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_autoscaling_group.webserver_example will be created
  + resource "aws_autoscaling_group" "webserver_example" {
      + arn                       = (known after apply)
      + availability_zones        = [
          + "eu-west-1a",
          + "eu-west-1b",
          + "eu-west-1c",
        ]
      + default_cooldown          = (known after apply)
      + desired_capacity          = (known after apply)
      + force_delete              = false
      + health_check_grace_period = 300
      + health_check_type         = "ELB"
      + id                        = (known after apply)
      + launch_configuration      = (known after apply)
      + load_balancers            = [
          + "webserver-example-qa",
        ]
      + max_size                  = 2
      + metrics_granularity       = "1Minute"
      + min_size                  = 2
      + name                      = (known after apply)
      + protect_from_scale_in     = false
      + service_linked_role_arn   = (known after apply)
      + target_group_arns         = (known after apply)
      + vpc_zone_identifier       = (known after apply)
      + wait_for_capacity_timeout = "10m"

      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "webserver-example-qa"
        }
    }

  # aws_elb.webserver_example will be created
  + resource "aws_elb" "webserver_example" {
      + arn                         = (known after apply)
      + availability_zones          = [
          + "eu-west-1a",
          + "eu-west-1b",
          + "eu-west-1c",
        ]
      + connection_draining         = false
      + connection_draining_timeout = 300
      + cross_zone_load_balancing   = true
      + dns_name                    = (known after apply)
      + id                          = (known after apply)
      + idle_timeout                = 60
      + instances                   = (known after apply)
      + internal                    = (known after apply)
      + name                        = "webserver-example-qa"
      + security_groups             = (known after apply)
      + source_security_group       = (known after apply)
      + source_security_group_id    = (known after apply)
      + subnets                     = (known after apply)
      + zone_id                     = (known after apply)

      + health_check {
          + healthy_threshold   = 2
          + interval            = 30
          + target              = "HTTP:8080/"
          + timeout             = 3
          + unhealthy_threshold = 2
        }

      + listener {
          + instance_port     = 8080
          + instance_protocol = "http"
          + lb_port           = 80
          + lb_protocol       = "http"
        }
    }

  # aws_launch_configuration.webserver_example will be created
  + resource "aws_launch_configuration" "webserver_example" {
      + arn                         = (known after apply)
      + associate_public_ip_address = false
      + ebs_optimized               = (known after apply)
      + enable_monitoring           = true
      + id                          = (known after apply)
      + image_id                    = "ami-0b508e9b54730f606"
      + instance_type               = "t2.micro"
      + key_name                    = (known after apply)
      + name                        = (known after apply)
      + security_groups             = (known after apply)
      + user_data                   = "4430fd6498339061effa6d27ccf341a1e94569d7"

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + no_device             = (known after apply)
          + snapshot_id           = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # aws_security_group.asg will be created
  + resource "aws_security_group" "asg" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "webserver-example-qa-asg"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.elb will be created
  + resource "aws_security_group" "elb" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "webserver-example-qa-elb"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + vpc_id                 = (known after apply)
    }

  # aws_security_group_rule.asg_allow_http_inbound will be created
  + resource "aws_security_group_rule" "asg_allow_http_inbound" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 8080
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 8080
      + type                     = "ingress"
    }

  # aws_security_group_rule.elb_allow_all_outbound will be created
  + resource "aws_security_group_rule" "elb_allow_all_outbound" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # aws_security_group_rule.elb_allow_http_inbound will be created
  + resource "aws_security_group_rule" "elb_allow_http_inbound" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 80
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "ingress"
    }

Plan: 8 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

This plan was saved to: /home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/5/default/live/qa/ec2/default.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/5/default/live/qa/ec2/default.tfplan"


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d live/qa/ec2`
* :put_litter_in_its_place: To **delete** this plan click [here](http://ip-172-31-37-232:8080/lock?id=vaibhav-walke%252Fterragrunt%252Flive%252Fqa%252Fec2%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d live/qa/ec2`
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
